Repository: miaoxworld/NativeTavern
Catalog: lib/l10n/app_*.arb
Languages: ms

source: Home
ms: Laman Utama

source: Characters
ms: Watak

source: Settings
ms: Tetapan

source: Chats
ms: Sembang

source: New Chat
ms: Sembang Baharu

source: No chats yet
ms: Tiada sembang lagi

# startNewConversation
source: Start a new conversation with a character
ms: Mulakan perbualan dengan watak

source: Browse Characters
ms: Layari Watak

source: Group Chats
ms: Sembang Kumpulan

source: Delete
ms: Padam

source: Cancel
ms: Batal

source: Save
ms: Simpan

source: Copy
ms: Salin

source: Retry
ms: Cuba Lagi

source: Close
ms: Tutup

source: Yes
ms: Ya

source: No
ms: Tidak

source: Loading...
ms: Memuatkan...

source: Error
ms: Ralat

# errorLoadingChats
source: Error loading chats: {error}
ms: Ralat memuatkan sembang: {error}

source: Delete Chat
ms: Padam Sembang

# deleteChatConfirmation
source: Are you sure you want to delete this chat? This action cannot be undone.
ms: Adakah anda pasti mahu memadamkan sembang ini? Tindakan ini tidak boleh dibatalkan.

source: Chat deleted
ms: Sembang dipadamkan

source: Yesterday
ms: Semalam

# daysAgo
source: {count} days ago
ms: {count} hari lepas

source: No messages
ms: Tiada mesej

source: No messages yet
ms: Tiada mesej lagi

source: Chat
ms: Sembang

# typeMessage
source: Type a message...
ms: Taip mesej...

source: Send
ms: Hantar

source: Regenerate
ms: Jana Semula

# continueGeneration
source: Continue
ms: Teruskan

source: View Character
ms: Lihat Watak

source: Author's Note
ms: Nota Penulis

source: Bookmarks
ms: Penanda Buku

source: Export Chat
ms: Eksport Sembang

source: Import Chat
ms: Import Sembang

source: Clear Messages
ms: Kosongkan Mesej

source: Select Model
ms: Pilih Model

source: Loading models...
ms: Memuatkan model...

# noModelsAvailable
source: No models available. Check your API configuration.
ms: Tiada model tersedia. Semak tetapan API anda.

# modelChangedTo
source: Model changed to {model}
ms: Model ditukar kepada {model}

# failedToLoadModels
source: Failed to load models: {error}
ms: Gagal memuatkan model: {error}

source: Search models...
ms: Cari model...

# noModelsMatchSearch
source: No models match your search
ms: Tiada model yang sepadan

source: Provider
ms: Pembekal

source: API Not Configured
ms: API Belum Dikonfigurasi

# apiNotConfiguredMessage
source: To chat with characters, you need to configure an LLM provider first.
ms: Untuk bersembang dengan watak, anda perlu mengkonfigurasi pembekal LLM terlebih dahulu.

source: Supported providers:
ms: Pembekal yang disokong:

source: Configure Now
ms: Konfigurasi Sekarang

source: Later
ms: Kemudian

source: Configure
ms: Konfigurasi

# configureApiProvider
source: Configure an LLM provider to start chatting
ms: Konfigurasi pembekal LLM untuk mula bersembang

# startConversation
source: Start a conversation
ms: Mulakan Perbualan

source: Delete Message
ms: Padam Mesej

# deleteMessageConfirmation
source: Are you sure you want to delete this message?
ms: Adakah anda pasti mahu memadamkan mesej ini?

source: Delete Messages
ms: Padam Mesej

# deleteMessagesConfirmation
source: Are you sure you want to delete this message and all messages after it?
ms: Adakah anda pasti mahu memadamkan mesej ini dan semua mesej selepasnya?

source: Delete All
ms: Padam Semua

source: Copied to clipboard
ms: Disalin ke papan keratan

# generateNewResponse
source: Generate a new response alternative
ms: Jana respons baharu

source: Continue from here
ms: Teruskan dari sini

# deleteMessagesAfterAndRegenerate
source: Delete messages after and regenerate response
ms: Padam mesej selepas ini dan jana semula

# deleteMessagesAfterThis
source: Delete messages after this one
ms: Padam semua mesej selepas ini

source: Create Bookmark
ms: Cipta Penanda Buku

# saveAsCheckpoint
source: Save this point as a checkpoint
ms: Simpan titik ini sebagai checkpoint

source: Delete this message
ms: Padam mesej ini

source: Delete this and all after
ms: Padam ini dan semua selepasnya

source: Attach image
ms: Lampirkan Imej

source: Choose from Gallery
ms: Pilih dari Galeri

source: Take Photo
ms: Ambil Foto

# failedToPickImage
source: Failed to pick image: {error}
ms: Gagal memilih imej: {error}

# failedToTakePhoto
source: Failed to take photo: {error}
ms: Gagal mengambil foto: {error}

# failedToAddAttachment
source: Failed to add attachment: {error}
ms: Gagal menambah lampiran: {error}

# exportChatWith
source: Export chat with {character}
ms: Eksport sembang dengan {character}

# messagesCount
source: {count} messages
ms: {count} mesej

source: Choose export format:
ms: Pilih format eksport:

source: JSONL (ST Format)
ms: JSONL (format ST)

source: No chat to export
ms: Tiada sembang untuk dieksport

# exportFailed
source: Export failed: {error}
ms: Eksport gagal: {error}

# importChatHistory
source: Import chat history from a file.
ms: Import sejarah sembang dari fail

source: Supported formats:
ms: Format yang disokong:

source: JSONL (SillyTavern format)
ms: JSONL (format SillyTavern)

source: JSON (NativeTavern format)
ms: JSON (format NativeTavern)

# importNote
source: Note: Imported messages will be added to the current chat.
ms: Nota: Mesej yang diimport akan ditambah ke sembang semasa.

source: Choose File
ms: Pilih Fail

# noFileSelected
source: No file selected or invalid format
ms: Tiada fail dipilih atau format tidak sah

source: Import Confirmation
ms: Pengesahan Import

source: Character
ms: Watak

source: User
ms: Pengguna

source: Messages
ms: Mesej

source: Date
ms: Tarikh

source: Has Author's Note
ms: Mempunyai nota penulis

# importMessagesToCurrentChat
source: Import these messages to the current chat?
ms: Import mesej-mesej ini ke sembang semasa?

source: No active chat
ms: Tiada sembang aktif

# importedMessages
source: Imported {count} messages
ms: Berjaya mengimport {count} mesej

# importFailed
source: Import failed: {error}
ms: Import gagal: {error}

# clearMessagesConfirmation
source: Are you sure you want to clear all messages? This cannot be undone.
ms: Adakah anda pasti mahu mengosongkan semua mesej? Tindakan ini tidak boleh dibatalkan.

source: Clear
ms: Kosongkan

source: Thinking
ms: Berfikir

source: No swipes available
ms: Tiada swipe tersedia

source: System
ms: Sistem

source: Background feature coming soon
ms: Ciri latar belakang akan datang

source: Author's note updated
ms: Nota penulis dikemas kini

source: Command Error
ms: Ralat arahan

source: Enabled
ms: Diaktifkan

source: Disabled
ms: Dinyahaktifkan

source: Personas
ms: Persona

source: Create Persona
ms: Cipta Persona

source: Delete Persona
ms: Padam Persona

# deletePersonaConfirmation
source: Are you sure you want to delete "{name}"?
ms: Adakah anda pasti mahu memadamkan "{name}"?

source: No personas yet
ms: Tiada persona lagi

# createPersonaDescription
source: Create a persona to represent yourself in chats
ms: Cipta persona untuk mewakili diri anda dalam sembang

source: Name
ms: Nama

source: Enter persona name
ms: Masukkan nama persona

source: Description
ms: Penerangan

# describePersona
source: Describe this persona (optional)
ms: Terangkan persona ini (pilihan)

# personaDescriptionHelp
source: The description will be included in the system prompt to help the AI understand who you are.
ms: Penerangan akan disertakan dalam prompt sistem untuk membantu AI memahami siapa anda.

# pleaseEnterName
source: Please enter a name
ms: Sila masukkan nama

source: Default
ms: Lalai

source: Active
ms: Aktif

source: Set as Default
ms: Tetapkan sebagai Lalai

source: Remove Avatar
ms: Buang Avatar

# failedToSaveAvatar
source: Failed to save avatar: {error}
ms: Gagal menyimpan avatar: {error}

source: Select Avatar Image
ms: Pilih imej avatar

source: AI Configuration
ms: Konfigurasi AI

source: LLM Provider
ms: Pembekal LLM

source: API URL
ms: URL API

source: API Key
ms: Kunci API

source: Temperature
ms: Suhu

source: Max Tokens
ms: Token Maksimum

source: Frequency Penalty
ms: Penalti Kekerapan

source: Presence Penalty
ms: Penalti Kehadiran

source: Repetition Penalty
ms: Penalti Pengulangan

source: Streaming Enabled
ms: Penstriman Diaktifkan

source: Test Connection
ms: Uji Sambungan

source: Connection successful!
ms: Sambungan berjaya!

# connectionFailed
source: Connection failed: {error}
ms: Sambungan gagal: {error}

source: Local
ms: Tempatan

source: AI Presets
ms: Pratetap AI

source: Create Preset
ms: Cipta Pratetap

source: Edit Preset
ms: Edit Pratetap

source: Delete Preset
ms: Padam Pratetap

source: Preset Name
ms: Nama Pratetap

source: Prompt Manager
ms: Pengurus Prompt

source: System Prompt
ms: Prompt Sistem

source: World Info
ms: Info Dunia

source: Create Entry
ms: Cipta Entri

source: Edit Entry
ms: Edit Entri

source: Delete Entry
ms: Padam Entri

source: Keywords
ms: Kata Kunci

source: Content
ms: Kandungan

source: Priority
ms: Keutamaan

source: Groups
ms: Kumpulan

source: Create Group
ms: Cipta Kumpulan

source: Edit Group
ms: Edit Kumpulan

source: Delete Group
ms: Padam Kumpulan

source: Group Name
ms: Nama Kumpulan

source: Members
ms: Ahli

source: Add Member
ms: Tambah Ahli

source: Remove Member
ms: Buang Ahli

source: Tags
ms: Tag

source: Create Tag
ms: Cipta Tag

source: Delete Tag
ms: Padam Tag

source: Tag Name
ms: Nama Tag

source: Color
ms: Warna

source: Quick Replies
ms: Balasan Pantas

source: Create Quick Reply
ms: Cipta Balasan Pantas

source: Edit Quick Reply
ms: Edit Balasan Pantas

source: Delete Quick Reply
ms: Padam Balasan Pantas

source: Message
ms: Mesej

source: Auto Send
ms: Hantar Auto

source: Create Regex
ms: Cipta regex

source: Delete Regex
ms: Padam regex

source: Pattern
ms: Corak

source: Replacement
ms: Penggantian

source: Backup
ms: Sandaran

source: Create Backup
ms: Cipta Sandaran

source: Restore Backup
ms: Pulihkan Sandaran

# backupCreated
source: Backup created successfully
ms: Sandaran berjaya dicipta

# backupRestored
source: Backup restored successfully
ms: Sandaran berjaya dipulihkan

# backupFailed
source: Backup failed: {error}
ms: Sandaran gagal: {error}

# restoreFailed
source: Restore failed: {error}
ms: Pemulihan gagal: {error}

source: Theme
ms: Tema

source: Dark Mode
ms: Mod Gelap

source: Light Mode
ms: Mod Cerah

source: System Theme
ms: Ikut Sistem

source: Primary Color
ms: Warna Utama

source: Accent Color
ms: Warna Aksen

source: Advanced
ms: Lanjutan

source: Advanced Settings
ms: Tetapan Lanjutan

source: Statistics
ms: Statistik

source: Total Chats
ms: Jumlah Sembang

source: Total Messages
ms: Jumlah Mesej

source: Total Characters
ms: Jumlah Watak

# tts
source: Text-to-Speech
ms: Teks-ke-Pertuturan

# stt
source: Speech-to-Text
ms: Pertuturan-ke-Teks

source: Translation
ms: Terjemahan

source: Image Generation
ms: Penjanaan Imej

source: Vector Storage
ms: Storan Vektor

source: Sprites
ms: Sprite

source: Backgrounds
ms: Latar Belakang

source: CFG Scale
ms: Skala CFG

source: Variables
ms: Pembolehubah

source: List view
ms: Paparan Senarai

source: Grid view
ms: Paparan Grid

source: Search
ms: Cari

source: Search characters...
ms: Cari watak...

source: No characters found
ms: Tiada watak dijumpai

source: No characters yet
ms: Tiada watak lagi

source: Import Character
ms: Import watak untuk bermula

source: Create Character
ms: Cipta Watak

source: Edit Character
ms: Edit Watak

source: Delete Character
ms: Padam Watak

# deleteCharacterConfirmation
source: Are you sure you want to delete "{name}"? This will also delete all chats with this character.
ms: Adakah anda pasti mahu memadamkan "{name}"? Semua sembang dengan watak ini juga akan dipadamkan.

source: Character deleted
ms: Watak dipadamkan

source: Start Chat
ms: Mulakan Sembang

source: Personality
ms: Personaliti

source: Scenario
ms: Senario

source: First Message
ms: Mesej Pertama

source: Example Dialogue
ms: Dialog Contoh

source: Creator Notes
ms: Nota Pencipta

source: Alternate Greetings
ms: Salam Alternatif

source: Character Book
ms: Buku Watak

source: Language
ms: Bahasa

source: Select Language
ms: Pilih Bahasa

source: Language changed
ms: Bahasa ditukar

source: About
ms: Tentang

source: Version
ms: Versi

source: Licenses
ms: Lesen

source: Privacy Policy
ms: Dasar Privasi

source: Terms of Service
ms: Terma Perkhidmatan

source: Feedback
ms: Maklum Balas

source: Rate App
ms: Nilai Aplikasi

source: Share App
ms: Kongsi Aplikasi

source: Check for Updates
ms: Semak Kemas Kini

source: No updates available
ms: Tiada kemas kini tersedia

source: Update available
ms: Kemas kini tersedia

source: Download Update
ms: Muat Turun Kemas Kini

source: Bookmark created
ms: Penanda buku dicipta

source: Bookmark Name
ms: Nama Penanda Buku

source: Enter bookmark name
ms: Masukkan nama penanda buku

source: No bookmarks yet
ms: Tiada penanda buku lagi

# createBookmarkDescription
source: Create bookmarks to save important points in your conversation
ms: Cipta penanda buku untuk menyimpan titik penting dalam perbualan

source: Jump to Bookmark
ms: Lompat ke Penanda Buku

source: Delete Bookmark
ms: Padam Penanda Buku

source: Bookmark deleted
ms: Penanda buku dipadamkan

source: Save as JSONL
ms: Simpan sebagai JSONL

source: Save as JSON
ms: Simpan sebagai JSON

source: Keyboard shortcuts:
ms: Pintasan papan kekunci:

source: Bold
ms: Tebal

source: Italic
ms: Italik

source: Underline
ms: Garis Bawah

source: Strikethrough
ms: Garis Potong

source: Inline code
ms: Kod Sebaris

source: Link
ms: Pautan

source: Slash Commands
ms: Arahan Slash

source: Available commands:
ms: Arahan yang tersedia:

# commandHelp
source: Type / to see available commands
ms: Taip / untuk melihat arahan yang tersedia
